---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowCircuitNumberOnOneRowForMultiphaseCircuits
source: html/2c400aa9-7d56-e1fb-8762-2ec3b603ddfe.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.ShowCircuitNumberOnOneRowForMultiphaseCircuits Property

Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise

## Syntax (C#)
```csharp
public bool ShowCircuitNumberOnOneRowForMultiphaseCircuits { get; set; }
```

## Remarks
Only applicable to two column formats